// --- World Manager ---
using UnityEngine;

/// <summary>
/// Класс <c>WorldManager</c> управляет загрузкой и инициализацией игрового мира в Fallen Kingdom.
/// Он отвечает за подготовку мира к игре и загрузку необходимых ресурсов.
/// </summary>
public class WorldManager : MonoBehaviour
{
    /// <summary>
    /// Инициализация мира при старте игры.
    /// Этот метод вызывается один раз при запуске сцены и загружает игровой мир.
    /// </summary>
    void Start()
    {
        LoadWorld();
    }

    /// <summary>
    /// Загружает игровой мир и инициализирует необходимые элементы.
    /// Этот метод может быть расширен для загрузки различных зон, объектов окружения
    /// и интерактивных элементов, таких как NPC и враги.
    /// </summary>
    void LoadWorld()
    {
        // Здесь можно добавить логику для загрузки мира, например, загрузку уровней или объектов
        Debug.Log("World Loaded.");
    }
}
